app/controllers/cities_controller.rb

SELECT * FROM `cities` LIMIT 0, 10
---
  def index
    @cities = City.paginate(:per_page => 10, :page => params[:page])

SELECT * FROM `cities` WHERE (`cities`.`id` = 1)
---
  def show
    @city = City.find(params[:id])

SELECT * FROM `cities` WHERE (`cities`.`id` = 1)
---
  def edit
    @city = City.find(params[:id])

INSERT INTO `cities` (`fundacao`, `created_at`, `nome`, `updated_at`, `populacao`, `aniversario`, `estado`) VALUES('2010-03-19', '2010-03-19 22:21:42', 'Cuiabá', '2010-03-19 22:21:42', '555555', '2010-03-19', 'MT')
---
  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save

SELECT * FROM `cities` WHERE (`cities`.`id` = 1)
UPDATE `cities` SET `updated_at` = '2010-03-19 23:00:48', `fundacao` = '1727-01-01', `aniversario` = '2010-04-08' WHERE `id` = 1
---
  def update
    @city = City.find(params[:id])

    respond_to do |format|
      if @city.update_attributes(params[:city])