app/controllers/hosts_controller.rb

SELECT * FROM `hosts` LIMIT 0, 10
---
  def index
    @hosts = Host.paginate(:per_page => 10, :page => params[:page])

SELECT * FROM `hosts` WHERE (`hosts`.`id` = 1)
---
  def show
    @host = Host.find(params[:id])

INSERT INTO `hosts` (`endereco`, `telefone`, `created_at`, `cidade_id`, `nome`, `cep`, `updated_at`, `bairro`, `fax`, `site`, `email`) VALUES('Av. Rubens de Mendonça, 1.718', '55 65 36425353', '2010-03-20 05:01:00', NULL, 'Paiaguás Palaca Hotel', '78050030', '2010-03-20 05:01:00', 'Baú', '', 'www.hotelpaiaguas.com.br', 'paiaguas@paiaguas.com.br')
---
  def create
    @host = Host.new(params[:host])

    respond_to do |format|
      if @host.save