app/controllers/tourpoints_controller.rb

SELECT * FROM `tourpoints` LIMIT 0, 10
---
  def index
    @tourpoints = Tourpoint.paginate(:per_page => 10, :page => params[:page])

SELECT * FROM `tourpoints` WHERE (`tourpoints`.`id` = 1)
---
  def show
    @tourpoint = Tourpoint.find(params[:id])

SELECT * FROM `tourpoints` WHERE (`tourpoints`.`id` = 1)
---
  def edit
    @tourpoint = Tourpoint.find(params[:id])

INSERT INTO `tourpoints` (`name`, `price`, `created_at`, `photo_file_size`, `updated_at`, `photo_file_name`, `whengo`, `photo_content_type`, `photo_updated_at`, `localization`, `whygo`, `description`, `city_id`, `whogo`) VALUES('teste', '', '2010-03-24 23:04:16', NULL, '2010-03-24 23:04:16', NULL, '', NULL, NULL, '', '', '', 1, '')
---
  def create
    @tourpoint = Tourpoint.new(params[:tourpoint])

    respond_to do |format|
      if @tourpoint.save

SELECT * FROM `tourpoints` WHERE (`tourpoints`.`id` = 1)
UPDATE `tourpoints` SET `updated_at` = '2010-03-24 23:26:14', `photo_file_name` = 'Parque_Mae_Bonifacia.jpg', `price` = '', `whogo` = '', `photo_updated_at` = '2010-03-24 23:26:13', `whygo` = '', `localization` = '', `photo_file_size` = 84436, `whengo` = '', `photo_content_type` = 'image/jpeg' WHERE `id` = 1
---
  def update
    @tourpoint = Tourpoint.find(params[:id])

    respond_to do |format|
      if @tourpoint.update_attributes(params[:tourpoint])