app/controllers/users_controller.rb

  def index
    @users = User.paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM `users` LIMIT 0, 10

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('854456275fcd2751b33623fa428e3fbda51a5132', '2010-03-19 20:35:55', 'bcf27f5e8cd6db57398f706adef911bfa78962bc', NULL, '2010-03-19 20:35:55', NULL, 'ramoel', 'ramoel@agileweb.com.br')